Terraform plan for __dev__
<details>
  <summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_global_address.postgres_private_ip_address will be created
  + resource "google_compute_global_address" "postgres_private_ip_address" {
      + address            = "10.4.0.0"
      + address_type       = "INTERNAL"
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + label_fingerprint  = (known after apply)
      + name               = "postgres-private-ip-range"
      + network            = "https://www.googleapis.com/compute/v1/projects/ebo-dev-321910/global/networks/ebo-dev-network"
      + prefix_length      = 20
      + project            = "ebo-dev-321910"
      + purpose            = "VPC_PEERING"
      + self_link          = (known after apply)
    }

  # google_service_networking_connection.postgres_private_vpc_connection will be created
  + resource "google_service_networking_connection" "postgres_private_vpc_connection" {
      + id                      = (known after apply)
      + network                 = "https://www.googleapis.com/compute/v1/projects/ebo-dev-321910/global/networks/ebo-dev-network"
      + peering                 = (known after apply)
      + reserved_peering_ranges = [
          + "postgres-private-ip-range",
        ]
      + service                 = "servicenetworking.googleapis.com"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

Plan generated in [Terraform #119](https://github.com/ebomart/commerce-infrastructure/actions/runs/1143274698)